src/services/kursach2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          18000;
        startFace       17730;
    }
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       35730;
    }
    outlet
    {
        type            patch;
        nFaces          90;
        startFace       35760;
    }
    triangles
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          180;
        startFace       35850;
    }
    topAndBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          240;
        startFace       36030;
    }
)

// ************************************************************************* //
