src/services/kursach2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.041246 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    topAndBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }


    frontAndBack
    {
        type            empty;
    }
    triangles
    {
    	type		fixedValue;
    	value           uniform (0 0 0);
    }
}

// ************************************************************************* //
