src/services/kursach2/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
}

divSchemes
{
    default none;

	div(phi,U) bounded Gauss linearUpwind grad(U);
	div(phi,k) bounded Gauss limitedLinear 1;
	div(phi,epsilon) bounded Gauss limitedLinear 1;
	div(phi,omega) bounded Gauss limitedLinear 1;
	div(phi,v2) bounded Gauss limitedLinear 1;
	div((nuEff*dev2(T(grad(U))))) Gauss linear;
	div(nonlinearStress) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
